In [1]:
import numpy as np
import pandas as pd

In [2]:
# Handling Missing datas

In [3]:
# Note: NaN(not a number): floating point value

In [4]:
type(np.nan)

float

In [5]:
string_data = pd.Series(['aaditya', 'aashish', np.nan, 'avogadro'])
string_data

0     aaditya
1     aashish
2         NaN
3    avogadro
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
#built in python value None is also NA

In [8]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
string_data.dropna()# delete the row that contains nan or na

1     aashish
3    avogadro
dtype: object

In [15]:
string_data.fillna('Arohi')

0       Arohi
1     aashish
2       Arohi
3    avogadro
dtype: object

In [16]:
# Filtering out missing data

In [17]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [18]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
# in dataframe
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [22]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis='columns', how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -1.484919 -0.200216  0.062433
1  1.381479 -1.182374 -0.850775
2 -0.521694  0.999033 -1.164787
3 -0.085685  0.515134 -1.316294
4  0.162585 -1.992238 -0.500158
5  1.075871  0.109444  0.851578
6 -0.341434 -0.276882  0.949970

In [26]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [27]:
df

          0         1         2
0 -1.484919       NaN       NaN
1  1.381479       NaN       NaN
2 -0.521694       NaN -1.164787
3 -0.085685       NaN -1.316294
4  0.162585 -1.992238 -0.500158
5  1.075871  0.109444  0.851578
6 -0.341434 -0.276882  0.949970

In [28]:
df.dropna()

          0         1         2
4  0.162585 -1.992238 -0.500158
5  1.075871  0.109444  0.851578
6 -0.341434 -0.276882  0.949970

In [29]:
df.dropna(thresh=2)

          0         1         2
2 -0.521694       NaN -1.164787
3 -0.085685       NaN -1.316294
4  0.162585 -1.992238 -0.500158
5  1.075871  0.109444  0.851578
6 -0.341434 -0.276882  0.949970

In [30]:
# Filling in missing data

In [31]:
df.fillna(0)

          0         1         2
0 -1.484919  0.000000  0.000000
1  1.381479  0.000000  0.000000
2 -0.521694  0.000000 -1.164787
3 -0.085685  0.000000 -1.316294
4  0.162585 -1.992238 -0.500158
5  1.075871  0.109444  0.851578
6 -0.341434 -0.276882  0.949970

In [32]:
df.fillna({1: 0.5, 2: 0}) # first col fill with 0.5 and second col fill with 0

          0         1         2
0 -1.484919  0.500000  0.000000
1  1.381479  0.500000  0.000000
2 -0.521694  0.500000 -1.164787
3 -0.085685  0.500000 -1.316294
4  0.162585 -1.992238 -0.500158
5  1.075871  0.109444  0.851578
6 -0.341434 -0.276882  0.949970

In [33]:
# to modify existing object 
df.fillna(0, inplace=True)

In [36]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.199405  1.132625 -0.074362
1 -0.678568 -0.706863 -0.386097
2 -0.917520  0.030606  1.196705
3 -0.718768  0.367311  0.860525
4  0.377228 -1.257771 -0.450364
5  2.118293  0.250188 -0.564923

In [37]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.199405  1.132625 -0.074362
1 -0.678568 -0.706863 -0.386097
2 -0.917520       NaN  1.196705
3 -0.718768       NaN  0.860525
4  0.377228       NaN       NaN
5  2.118293       NaN       NaN

In [38]:
df.fillna(method='ffill')

          0         1         2
0  0.199405  1.132625 -0.074362
1 -0.678568 -0.706863 -0.386097
2 -0.917520 -0.706863  1.196705
3 -0.718768 -0.706863  0.860525
4  0.377228 -0.706863  0.860525
5  2.118293 -0.706863  0.860525

In [39]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.199405  1.132625 -0.074362
1 -0.678568 -0.706863 -0.386097
2 -0.917520 -0.706863  1.196705
3 -0.718768 -0.706863  0.860525
4  0.377228       NaN  0.860525
5  2.118293       NaN  0.860525

In [41]:
df.fillna(0, inplace=True)
df

          0         1         2
0  0.199405  1.132625 -0.074362
1 -0.678568 -0.706863 -0.386097
2 -0.917520  0.000000  1.196705
3 -0.718768  0.000000  0.860525
4  0.377228  0.000000  0.000000
5  2.118293  0.000000  0.000000

In [42]:
data = pd.Series([1., NA, 3.5, NA, 7.])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64